/*
Всі роботи проводяться з файлом у бінарному режимі.
Використовувати масив не можна.
Написати такі функції:
1. Згенерувати у файл випадкові цілі числа від -100 до 100. Кількість чисел випадкова від 1 – 100.
2. Підрахувати кількість чисел у файлі;
3. Підрахувати суму чисел у файлі;
4. Підрахувати середнє арифметичне чисел у файлі;
5. Вивести числа більші за середнє арифметичне.
6. Відсортувати числа у файлі за зростанням. Зробити меню для тестування функцій.
*/
#include <iostream>
using namespace std;
void Save() {
	FILE* fs = NULL;
	//r - read    w - write    r+  rb wb rt wt w+t w+b
	//a - add tail b - binary t - text     //fs = fopen("1.txt", "w");
	auto error = fopen_s(&fs, "2.txt", "w");
	if (error) {
		//if ( fs == NULL) {
		cout << "I can not create the file";
		return;
		exit(error);
	}
	putc('A', fs);
}

int main() {
	Save();
}
